examples/twophaseflux/windSandShockTube/0/Tp
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Tp;
}

dimensions [0 0 0 1 0 0 0];
internalField nonuniform List<scalar>
100
(
1
1
1
1
1
1
1
1
...
);

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
