examples/twophaseflux/windSandShockTube/0/rho
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}

dimensions [1 -3 0 0 0 0 0];
internalField nonuniform List<scalar>
100
(
1
1
1
1
1
1
1
1
...
);

boundaryField
{
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    sides
    {
        type empty;
    }
}
