examples/twophaseflux/windSandShockTube/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    "(p|U|rho|T|Tglobal|phiLS|h|he).*"
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-12;
        relTol 0;
    }
}
relaxationFactors {}
